results/results_c5_large/results_c5_large_run1/oltp_read_write_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 45.09 qps: 907.25 (r/w/o: 636.29/45.19/225.76) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 42.80 qps: 857.12 (r/w/o: 599.32/43.00/214.81) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 45.70 qps: 910.90 (r/w/o: 637.70/46.30/226.90) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 44.20 qps: 883.20 (r/w/o: 618.00/44.50/220.70) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 42.90 qps: 861.10 (r/w/o: 603.00/43.20/214.90) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 46.80 qps: 934.20 (r/w/o: 654.10/46.80/233.30) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 42.80 qps: 856.60 (r/w/o: 599.40/43.00/214.20) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 44.10 qps: 881.20 (r/w/o: 616.80/44.40/220.00) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 44.90 qps: 900.40 (r/w/o: 630.90/45.60/223.90) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 43.70 qps: 868.70 (r/w/o: 606.90/45.00/216.80) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 44.50 qps: 894.60 (r/w/o: 627.20/45.50/221.90) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 45.20 qps: 903.90 (r/w/o: 632.60/47.10/224.20) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            74634
        write:                           5399
        other:                           26587
        total:                           106620
    transactions:                        5331   (44.41 per sec.)
    queries:                             106620 (888.14 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      44.4069
    time elapsed:                        120.0490s
    total number of events:              5331

Latency (ms):
         min:                                   34.50
         avg:                                   90.05
         max:                                  321.14
         95th percentile:                      161.51
         sum:                               480077.70

Threads fairness:
    events (avg/stddev):           1332.7500/7.76
    execution time (avg/stddev):   120.0194/0.02